#+CATEGORY: ░ SH.WRAP ░
#+FILETAGS: #project #task sh.wrap
#+OPTIONS: ^:nil toc:nil num:nil author:nil timestamp:nil
#+COLUMNS: %50ITEM TODO %3PRIORITY %Effort %Effort(Effort Children){:} %10CLOCKSUM
#+OPTIONS: H:1 prop:nil d:nil tags:nil p:t c:nil pri:t

#+HUGO_BASE_DIR: ../site
#+HUGO_SECTION: project
#+HUGO_FRONT_MATTER_FORMAT: yaml
#+HUGO_CUSTOM_FRONT_MATTER:
#+HUGO_DRAFT: false

#+begin_export markdown
---
title: Pool of tasks
date: 2022-05-21T04:04:13+03:00
aliases:
  - /project/todo/todo.md
  - /project/todo/todo.org
url: /project/todo/todo.html
---
#+end_export

*** DONE Add auto-generation of project documentation
    CLOSED: [2022-11-05 Sat 16:12] DEADLINE: <2022-10-31 Mon> SCHEDULED: <2022-10-31 Mon>
    :PROPERTIES:
    :Effort:   01:00
    :END:
    :LOGBOOK:
    - State "DONE"       from "PROGRESS"   [2022-11-05 Sat 16:12]
    CLOCK: [2022-11-05 Sat 14:09]--[2022-11-05 Sat 15:00] =>  0:51
    - State "PROGRESS"   from "STARTED"    [2022-11-05 Sat 13:28] \\
      passed review
    CLOCK: [2022-11-02 Wed 12:48]--[2022-11-02 Wed 13:56] =>  1:08
    - State "STARTED"    from "NEXT"       [2022-11-02 Wed 12:48]
    :END:
    <2022-10-31 Mon>

*** DONE Add basic hugo templates and site config
    CLOSED: [2022-10-29 Sat 10:24] DEADLINE: <2022-05-21 Sat>
    :LOGBOOK:
    - State "DONE"       from "PROGRESS"   [2022-10-29 Sat 10:24]
    - State "PROGRESS"   from "PROGRESS"   [2022-10-27 Thu 04:09] \\
      project uses docsy hugo theme
      ready for review
    CLOCK: [2022-05-21 Sat 13:11]--[2022-05-21 Sat 13:37] =>  0:26
    - State "PROGRESS"   from "PROGRESS"   [2022-05-21 Sat 13:04] \\
      'project' section configured
    CLOCK: [2022-05-21 Sat 12:35]--[2022-05-21 Sat 13:04] =>  0:29
    - State "PROGRESS"   from "TODO"       [2022-05-21 Sat 12:27] \\
      basic templates and config are taken from the hugo documentation
    :END:
    <2022-05-21 Sat>

*** DONE Delete org files from repositories
    CLOSED: [2022-10-17 Mon 17:41] DEADLINE: <2022-10-17 Mon> SCHEDULED: <2022-10-17 Mon>
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2022-10-17 Mon 17:41]
    CLOCK: [2022-10-17 Mon 03:35]--[2022-10-17 Mon 04:17] =>  0:42
    CLOCK: [2022-10-17 Mon 02:10]--[2022-10-17 Mon 03:19] =>  1:09
    - State "STARTED"    from "TODO"       [2022-10-17 Mon 02:10]
    :END:
    <2022-10-17 Mon>

*** DONE Actions to export project documentation to GH pages
    CLOSED: [2022-10-29 Sat 10:24] DEADLINE: <2022-05-21 Sat> SCHEDULED: <2022-05-21 Sat>
    :PROPERTIES:
    :Effort:   03:00
    :END:
    :LOGBOOK:
    - State "DONE"       from "PROGRESS"   [2022-10-29 Sat 10:24]
    - State "PROGRESS"   from "PROGRESS"   [2022-10-16 Sun 18:05] \\
      actions are ready for review
    CLOCK: [2022-10-13 Thu 21:53]--[2022-10-13 Thu 22:41] =>  0:48
    CLOCK: [2022-10-13 Thu 16:19]--[2022-10-13 Thu 18:57] =>  2:38
    CLOCK: [2022-10-04 Tue 19:16]--[2022-10-04 Tue 19:47] =>  0:31
    CLOCK: [2022-10-04 Tue 18:40]--[2022-10-04 Tue 18:43] =>  0:03
    - State "PROGRESS"   from "PROGRESS"   [2022-06-05 Sun 23:32] \\
      org: renamed
    - State "PROGRESS"   from "NEXT"       [2022-06-05 Sun 23:31] \\
      Tested working in antirs/test-docker-action with antirs/antirs.github.io repositories.
    :END:

**** DONE Create GH docker action to build hugo binary
     CLOSED: [2022-06-05 Sun 23:37] SCHEDULED: <2022-05-21 Sat>
     :LOGBOOK:
     - State "DONE"       from "PROGRESS"   [2022-06-05 Sun 23:37]
     - State "PROGRESS"   from "PROGRESS"   [2022-06-05 Sun 23:37] \\
       tested working
     CLOCK: [2022-06-05 Sun 23:35]--[2022-06-05 Sun 23:37] =>  0:02
     CLOCK: [2022-05-31 Tue 18:57]--[2022-05-31 Tue 18:57] =>  0:00
     CLOCK: [2022-05-31 Tue 18:55]--[2022-05-31 Tue 18:55] =>  0:00
     CLOCK: [2022-05-25 Wed 02:04]--[2022-05-25 Wed 02:05] =>  0:01
     - State "PROGRESS"   from "PROGRESS"   [2022-05-22 Sun 20:38] \\
       next:
       - add cache
       - add GH error/notice reporting
     - State "PROGRESS"   from "PROGRESS"   [2022-05-22 Sun 16:24] \\
       successfully building hugo binary with gh action
     - State "PROGRESS"   from "STARTED"    [2022-05-22 Sun 14:40] \\
       making improvements and testing actions-shellcheck to merge with actions-hugo-*
     CLOCK: [2022-05-22 Sun 14:40]--[2022-05-22 Sun 16:24] =>  1:44
     CLOCK: [2022-05-22 Sun 10:58]--[2022-05-22 Sun 13:58] =>  3:00
     CLOCK: [2022-05-22 Sun 00:02]--[2022-05-22 Sun 00:23] =>  0:21
     CLOCK: [2022-05-21 Sat 22:08]--[2022-05-22 Sun 00:02] =>  1:54
     CLOCK: [2022-05-21 Sat 20:49]--[2022-05-21 Sat 21:41] =>  0:52
     CLOCK: [2022-05-21 Sat 16:41]--[2022-05-21 Sat 19:13] =>  2:32
     - State "STARTED"    from "TODO"       [2022-05-21 Sat 20:48]
     :END:

**** DONE Create GH docker action to generate documentation
     CLOSED: [2022-06-05 Sun 23:37] SCHEDULED: <2022-05-21 Sat>
     :LOGBOOK:
     - State "DONE"       from "PROGRESS"   [2022-06-05 Sun 23:37]
     - State "PROGRESS"   from "PROGRESS"   [2022-06-05 Sun 23:37] \\
       tested working
     CLOCK: [2022-05-31 Tue 18:57]--[2022-05-31 Tue 18:57] =>  0:00
     CLOCK: [2022-05-24 Tue 18:10]--[2022-05-24 Tue 18:11] =>  0:01
     - State "PROGRESS"   from "TODO"       [2022-05-22 Sun 20:57] \\
       done:
       - composition of hugo build and hugo site generation steps in one action
       - generation of site
       next:
       - publishing to site portal
     :END:

**** DONE Create a branch for GH docker action to generate documentation
     CLOSED: [2022-06-05 Sun 23:28] SCHEDULED: <2022-05-21 Sat>
     :LOGBOOK:
     - State "DONE"       from "PROGRESS"   [2022-06-05 Sun 23:28]
     - State "PROGRESS"   from "PROGRESS"   [2022-06-05 Sun 23:27] \\
       Let all actions are in the source repository.
     - State "PROGRESS"   from "STARTED"    [2022-05-22 Sun 18:41] \\
       testing solution in the other repository
     CLOCK: [2022-05-22 Sun 17:48]--[2022-05-22 Sun 19:58] =>  2:10
     CLOCK: [2022-05-22 Sun 16:26]--[2022-05-22 Sun 17:07] =>  0:41
     - State "STARTED"    from "TODO"       [2022-05-22 Sun 16:26]
     :END:

*** DONE Add actions docker images to docker hub
    CLOSED: [2022-11-02 Wed 10:51] DEADLINE: <2022-11-01 Tue> SCHEDULED: <2022-10-31 Mon>
    :PROPERTIES:
    :Effort:   02:00
    :END:
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2022-11-02 Wed 10:51]
    - State "STARTED"    from "NEXT"       [2022-11-01 Tue 11:29]
    CLOCK: [2022-11-01 Tue 11:29]--[2022-11-01 Tue 13:32] =>  2:03
    :END:
    <2022-10-31 Mon>

*** DONE Add docker image for hugo site generation
    CLOSED: [2022-10-29 Sat 10:24] DEADLINE: <2022-05-21 Sat>
    :LOGBOOK:
    - State "DONE"       from "PROGRESS"   [2022-10-29 Sat 10:24]
    CLOCK: [2022-05-21 Sat 11:55]--[2022-05-21 Sat 12:24] =>  0:29
    CLOCK: [2022-05-21 Sat 02:34]--[2022-05-21 Sat 03:21] =>  0:47
    - State "PROGRESS"   from "NEXT"       [2022-05-21 Sat 02:12] \\
      basic images with hugo and pandoc for site generation are added
    :END:
    <2022-05-21 Sat>

*** DONE Create a branch for project tracking
    CLOSED: [2022-05-13 Fri 22:42] SCHEDULED: <2022-05-13 Fri>
    :LOGBOOK:
    - State "DONE"       from "PROGRESS"   [2022-05-13 Fri 22:42]
    - State "PROGRESS"   from "STARTED"    [2022-05-13 Fri 22:42] \\
      ekotik/project branch created
    CLOCK: [2022-05-13 Fri 19:43]--[2022-05-13 Fri 21:10] =>  1:27
    CLOCK: [2022-05-13 Fri 19:34]--[2022-05-13 Fri 19:35] =>  0:01
    - State "STARTED"    from "NEXT"       [2022-05-13 Fri 19:27]
    :END:

*** DONE Create infra account on docker hub
    CLOSED: [2022-11-01 Tue 10:01] DEADLINE: <2022-11-01 Tue> SCHEDULED: <2022-10-31 Mon>
    :PROPERTIES:
    :Effort:   01:00
    :END:
    :LOGBOOK:
    - State "DONE"       from "PROGRESS"   [2022-11-01 Tue 10:01]
    CLOCK: [2022-11-01 Tue 09:34]--[2022-11-01 Tue 10:01] =>  0:27
    - State "PROGRESS"   from "STARTED"    [2022-10-31 Mon 15:12]
    - State "STARTED"    from "NEXT"       [2022-10-31 Mon 13:02]
    CLOCK: [2022-10-31 Mon 13:02]--[2022-10-31 Mon 15:12] =>  2:10
    :END:
    <2022-10-31 Mon>
*** DONE Rework org to markdown scripts and workflows <<rotmsaw>>
    CLOSED: [2022-11-05 Sat 14:05] DEADLINE: <2022-10-31 Mon> SCHEDULED: <2022-10-31 Mon>
    :PROPERTIES:
    :Effort:   03:00
    :END:
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2022-11-05 Sat 14:05]
    CLOCK: [2022-11-03 Thu 00:04]--[2022-11-03 Thu 02:52] =>  2:48
    CLOCK: [2022-11-02 Wed 13:58]--[2022-11-02 Wed 14:10] =>  0:12
    - State "STARTED"    from "NEXT"       [2022-11-02 Wed 13:58]
    :END:
    <2022-10-31 Mon>

**** DONE Remove conversion funcs from hugo-site workflow and script
     CLOSED: [2022-11-05 Sat 13:58] SCHEDULED: <2022-11-05 Sat> DEADLINE: <2022-11-05 Sat>
     :PROPERTIES:
     :Effort:   00:30
     :END:
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2022-11-05 Sat 13:58]
     CLOCK: [2022-11-05 Sat 13:38]--[2022-11-05 Sat 13:58] =>  0:20
     - State "STARTED"    from "NEXT"       [2022-11-05 Sat 13:38]
     :END:
     <2022-11-05 Sat>
